WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_timer_support.c
// #if HCOM_DIAG_OUTPUT_SYSLOG_PID_OF_NEW_THREADS > 0
  syslog(2, "New kthread [PID:%d],'%s'\n", getpid(), MEADOW_TIMER_EXPERIMENT_THREAD_NAME);
  usleep(10 * 1000);  
// #endif

  sem_init(&_endCountSem, 0, 0);
  sem_setprotocol(&_endCountSem, SEM_PRIO_NONE);

  // General timer initialization
  struct timerInfo_s *timerInfo = meadow_timer_init_general(MEADOW_TIMER_EXPERIMENT_NUMBER);
  if(timerInfo == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Meadow timer init failed\n", __FILE__, __LINE__);
    return NULL;
  }

  ret = meadow_timer_init_gated_pulse_width(timerInfo);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Meadow pulsh width init failed:%d\n", __FILE__, __LINE__, ret);
    return NULL;
  }
  
  // Final initialization
  meadow_timer_enable(timerInfo);

  // -------------------------------------------------------------------------
  // Attempt to simulate normal operation via this loop.
  // Note: this is built around the HC-SR04.
  uint32_t timeOutErrCnt = 0;
  while(true)
  {
    // For normal testing use the following sleep. Remove it to do more of a
    // torture test
    // usleep(1000 * 1000);

    // Clear all timer counter's
    if(timerInfo->timerWidth == 16)
      putreg16(0, timerInfo->timerBase + STM32_GTIM_CNT_OFFSET);
    else
      putreg32(0, timerInfo->timerBase + STM32_GTIM_CNT_OFFSET);
    
    timerInfo->timerOvrFlow = 0;

    // Should be done by MONO code
    // Send pulse to HC-SR04, this must be at least 2us wide to signal the
    // HC-SR04 to send ultrasonic pulses and wait for the echo.
    stm32_gpiowrite(MEADOW_TIMER_TEST_GPIO_D15_OUT, true);

    // HC-SR04 requires a trigger pulse of at least 2 usec. However, a 1-2 ms
    // pulse works too. Because of the Nuttx usleep resolution the following
    // usleep(1) will sleep between 1-2 ms. The HC-SR04 generates it's timing
    // pulse (echo) about 500us after the trigger pulses falling edge.
    usleep(1);

    stm32_gpiowrite(MEADOW_TIMER_TEST_GPIO_D15_OUT, false);

    // Wait for ISR to indicate that timer has ended
    struct timespec abstime;
    ret = clock_gettime(CLOCK_REALTIME, &abstime);
    abstime.tv_sec += 2;    // This delay could be supplied by .Net user
    abstime.tv_nsec = 0;
    ret = sem_timedwait(&_endCountSem, &abstime);
    if(ret < 0)
    {
      if(errno == ETIMEDOUT)
      {
        timeOutErrCnt++;
        syslog(1, "--> ERROR:Semaphore timeout:%u ,ret:%d, errno:%d\n", timeOutErrCnt, ret, errno);

      }
      else
      {
        syslog(1, "--> ERROR:Semaphore ret:%d, errno:%d\n", ret, errno);
      }

      // An error can means that the semaphore timed out. In this case we to
      // insure that the semaphore count is correct. If not correct, it means
      // that the ISR didn't do the sem_post() call. Therefore, we need to call
      // sem_post to keep the semaphore in sync with the ISR.
      int semcount;
      sem_getvalue(&_endCountSem, &semcount);
      if(semcount == 0)
        sem_post(&_endCountSem); 
    }
    else
    {
      // Successfully read the pulse width
      //
      // Purely diagnostic display for the HC-SR04.
      if(++displayCount % 10 == 0)
      {
        uint64_t cntValue;
        if(timerInfo->timerWidth == 16)
          cntValue = timerInfo->timerCount + (timerInfo->timerOvrFlow * 0xffff);
        else
          cntValue = timerInfo->timerCount + (timerInfo->timerOvrFlow * 0xffffffff);

        if(cntValue > 0)
        {
          // Temperature effects speed of sound. At 20 degrees C = 343.21 M/Sec at 25 = 346.13
          double totalTime = (double)cntValue / (double)timerInfo->timerClkFreq;
          double oneWayTime = totalTime/2.0;
          double distance = oneWayTime /*seconds*/ * 345; /* meters/second*/
          syslog(1, "=====> Count:%lu, Time:%4.8fms, Distance:%1.6fm [overflow:%lu, ErrCnt:%u]\n",
                    cntValue, oneWayTime * 1000, distance, timerInfo->timerOvrFlow, timeOutErrCnt);
        }
        else
        {
          syslog(1, "--> ERROR:Timer %u count was %lu\n", timerInfo->timerNumb, cntValue);
        }
      }
    }
  }

  return NULL;    // Keep compiler happy
}

//=============================================================
// Scheme from stm32_tim.c stm32_tim_disable()
void meadow_timer_disable(struct timerInfo_s *timerInfo)
{
  uint32_t timerBase = timerInfo->timerBase;

  uint16_t regval = getreg16(timerBase + STM32_BTIM_CR1_OFFSET);
  regval &= ~ATIM_CR1_CEN;
  putreg16(regval, timerBase + STM32_BTIM_CR1_OFFSET);
}

//=============================================================
// Scheme from stm32_tim.c stm32_tim_enable()
void meadow_timer_enable(struct timerInfo_s *timerInfo)
{
  uint32_t timerBase = timerInfo->timerBase;

  // Why this order? tryed to copy the NUTTX order
  uint16_t cr1Val = getreg16(timerBase + STM32_GTIM_CR1_OFFSET);
  cr1Val |= GTIM_CR1_CEN;
  uint16_t egrVal = getreg16(timerBase + STM32_GTIM_EGR_OFFSET);
  egrVal |= GTIM_EGR_UG;
  putreg16(egrVal, timerBase + STM32_GTIM_EGR_OFFSET);
  putreg16(cr1Val, timerBase + STM32_GTIM_CR1_OFFSET);
}

//=============================================================
// The provide timerNumber (1-14) to configure. Returns the correct table entry.
struct timerInfo_s * meadow_timer_init_general(int timerNumber)
{
  int ret;
  uint16_t regval;
  uint16_t prescaler;
  struct timerInfo_s *timerInfo = &(timerData[timerNumber - 1]);

  uint32_t timerBase = timerInfo->timerBase;

  // Setup the clock to enable
  modifyreg32(timerInfo->timerAPBClk, 0, timerInfo->timerClkEn);

  meadow_timer_disable(timerInfo);

  // Calculate by prescaler = timerInfo->timerClkFreq / desired frequency
  // Must be between 0 and 0xffff.
  prescaler = 0;  // Set the prescaler value of 0 to allow highest speed
  putreg16(prescaler, timerBase + STM32_GTIM_PSC_OFFSET);

  // The value put into the ARR is maximum
  uint32_t maxARRValue = timerInfo->timerWidth == 16 ? 0xffff : 0xffffffff;
  putreg32(maxARRValue, timerBase + STM32_GTIM_ARR_OFFSET);

  // All interupts are handled by same isr, at least for now
  // Set the interrupt handler
  xcpt_t isrHandler = meadow_timer_isr;
  ret = irq_attach(timerInfo->timerIrqVec, isrHandler, timerInfo);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-irq_attach failed:%d, errno:%d\n",
          __FILE__, __LINE__, ret, errno);
    return NULL;
  }

  syslog(1, "---> Enabling IRQ up_enable_irq\n");

  // Nuttx handles the interrupts
  up_enable_irq(timerInfo->timerIrqVec);

  // Final setup.
  regval = getreg16(timerBase + STM32_GTIM_CR1_OFFSET);
  regval |= GTIM_CR1_ARPE;    // Auto Reload Pre-Load enable bit
  putreg16(regval, timerBase + STM32_GTIM_CR1_OFFSET);

