WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_timer_support.c
  // Not sure if this is needed
  //  regval = getreg16(timerBase + STM32_GTIM_EGR_OFFSET);
  //   // From Reference 25.3.11
  //   // As the preload registers are transferred to the shadow registers only when an update event
  //   // occurs, before starting the counter, you have to initialize all the registers by setting the UG
  //   // bit in the TIMx_EGR register.
  //   regval |= GTIM_EGR_UG;   /* Bit 0: Update generation */
  //   putreg16(regval, timerBase + STM32_GTIM_EGR_OFFSET);

  // // If timer channel input, tell Nuttx what we care about
  // ret = stm32_gpiosetevent(
  //           cfgset,               // special gpio for call
  //           1,                    // risingEdge,
  //           1,                    // fallingEdge,
  //           0,                    // event
  //           upd_gpio_interrupt,   // function to call
  //           gpioMapTblPtr);       // table entry pointer
  
  return timerInfo;
}

//=============================================================
// Pulse Width inititalization
int meadow_timer_init_gated_pulse_width(struct timerInfo_s *timerInfo)
{
  // Setup for timer gate-controlled measurement. This will be our base line
  // for determining the best possible performance. When other techniques are
  // tried we can compare to this gate-controlled method.

  uint32_t timerBase = timerInfo->timerBase;
  
  // Disable slave mode while configuring
  uint32_t smcr_val = getreg32(timerBase + STM32_GTIM_SMCR_OFFSET);
  smcr_val &= ~GTIM_SMCR_DISAB;
  putreg32(smcr_val, timerBase + STM32_GTIM_SMCR_OFFSET);

  // DMA/Interrupt enable register (DIER)
  // Don't know so set for a bunch of interrpts and keep the one the matter
  uint16_t regval16new;
  uint16_t regval16;

  // What source generates an interrupts?
  // GTIM_DIER_UIE overflow or underflow
  // GTIM_DIER_TIE in gated mode when counter starts or stops
  regval16new = GTIM_DIER_UIE | GTIM_DIER_TIE;
  // regval16new = GTIM_DIER_TIE;
  // regval16new = GTIM_DIER_UIE |
  //               GTIM_DIER_CC1IE | GTIM_DIER_CC2IE | GTIM_DIER_CC3IE | GTIM_DIER_CC4IE |
  //               GTIM_DIER_TIE;
  
  syslog(1, "--> Setting up interrupt sources\n");
  // Set the interrupt sources
  regval16 = getreg16(timerBase + STM32_GTIM_DIER_OFFSET);
  regval16 |= regval16new;
  putreg16(regval16, timerBase + STM32_GTIM_DIER_OFFSET);

  syslog(1, "--> Setting up Edge Detector and Gated Mode\n");
  // Set TI1 or TI2 Edge Detector and Gated Mode
  // GTIM_SMCR_TI1FP1 GTIM_SMCR_TI1FP2
  smcr_val |= (GTIM_SMCR_TI1FP1 | GTIM_SMCR_GATED);
  putreg32(smcr_val, timerBase + STM32_GTIM_SMCR_OFFSET);

  // syslog(1, "--> Just set input and Gated mode:0x%08x\n", smcr_val);
  // usleep(20 * 1000);
  return OK;
}

#endif    // #if defined(CONFIG_MEADOW_TIMER_SUPPORT)